Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: དེ་མི་ཟད་པ་དང་། མཐའ་ཡས་པ་དང་། ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བ་དང་། ཐམས་ཅད་ལ་འཇུག་པའི་རྗེས་སུ་སོང་བ་ཡིན་ནོ། །དེ་ལ་རྒྱུན་ཆད་པ་མེད་དོ། །ཆགས་པ་མེད་དོ། །
en: With regard to all engagements, such a bodhisattva does not become exhausted, has no limitations, and is capable of going everywhere.

source: ལུས་ལྕི་བ་མེད་དོ། །
en: The mind of such a bodhisattva does not stay in one place, the body of such a bodhisattva has no heaviness, and the thoughts of such a bodhisattva are not of discouragement.

source: སེམས་ཞུམ་པ་མེད་དོ། །དེ་སངས་རྒྱས་བརྒྱ་སྟོང་གི་སྤྱན་སྔར་སྟོན་ཀྱང་ཞུམ་པར་མི་འགྱུར་ཏེ།
en: Even when teaching in front of hundreds of thousands of buddhas, such a bodhisattva is undaunted.

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེས་གཟུངས་དང་། ཤེས་རབ་དང་། ཡེ་ཤེས་དང་། སྤོབས་པ་ཐོབ་བོ། །
en: For, indeed, empowered by the empowering authority of the buddhas, this bodhisattva has obtained inspired eloquence, knowledge, wisdom, and a powerful memory and the formulas that support it.

source: དེ་སྟོན་ཀྱང་ཞུམ་པར་མི་འགྱུར། ཀུན་ཏུ་ཞུམ་པར་མི་འགྱུར་ཞིང་ཟློག་པར་མི་འགྱུར་ཏེ།
en: “This bodhisattva teaches, but remains undaunted, does not hide, and does not turn back.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཆགས་པ་མེད་པ་གསུམ་གྱི་རྗེས་སུ་སོང་བ་ཡིན་ནོ། །གསུམ་གང་ཞེ་ན། བདག་ལ་ཆགས་པ་མེད་པ་དང་། སེམས་ཅན་ལ་ཆགས་པ་མེད་པ་དང་། ཆོས་ལ་ཆགས་པ་མེད་པའོ། །
en: For, indeed, the bodhisattva adheres to three forms of detachment: detachment from self, detachment from beings, and detachment from things.

source: ཡོངས་སུ་དག་པ་གསུམ་གྱི་རྗེས་སུ་སོང་བ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་དག་པ་དང་། དེ་བཞིན་ཉིད་ཡོངས་སུ་དག་པ་དང་། ཡང་དག་པའི་མཐའ་ཡོངས་སུ་དག་པའོ། །
en: The bodhisattva adheres to three forms of purity: the purity of the realm of reality, the purity of the way things are, and the purity of the true end.

source: མི་ཟད་པ་གསུམ་གྱི་རྗེས་སུ་སོང་བ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། ཆོས་མི་ཟད་པ་དང་། ཡི་གེ་མི་ཟད་པ་དང་། བསྟན་པ་མི་ཟད་པའོ། །
en: The bodhisattva adheres to the three imperishables: the imperishable nature of things, the imperishable nature of syllables, and the imperishable nature of teachings.

source: བྱིན་གྱི་རླབས་གསུམ་ཐོབ་པ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། སྤོབས་པའི་བྱིན་གྱི་རླབས་དང་། ཆོས་ཀྱི་དོན་གྱི་བྱིན་གྱི་རླབས་དང་། ཆོས་ལ་འཇུག་པའི་བྱིན་གྱི་རླབས་སོ། །
en: “This bodhisattva acquires three kinds of empowerment: the empowerment in inspired eloquence, the empowerment in the meaning of the Dharma, and the empowerment in the use of the Dharma.

source: དགའ་བ་གསུམ་ཐོབ་པ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། ཡེ་ཤེས་ཀྱིས་དགའ་བ་དང་། ཤེས་རབ་ཀྱིས་དགའ་བ་དང་། ཐེ་ཙོམ་ཆད་པས་དགའ་བའོ། །
en: This bodhisattva obtains three kinds of joy: the joy of knowledge, the joy of wisdom, and the joy of removing doubt.

source: མྱུར་བ་གསུམ་ཐོབ་པ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། དྲན་པ་མྱུར་བ་དང་། བློ་གྲོས་མྱུར་བ་དང་། རྟོགས་པ་མྱུར་བའོ། །
en: This bodhisattva obtains three types of swiftness: the swiftness of mindfulness, the swiftness of intelligence, and the swiftness of understanding.”

source: གཟུངས་ཀྱི་ཡོན་ཏན་བསྔགས་པའི་དཔེ་དགོད་པ་མི་ཟད་པ་བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་བརྒྱས་གཟུངས་ཐོབ་པར་གྱུར་ཏོ། །
en: While this teaching on a powerful memory and the formulas that support it was being taught, eight hundred bodhisattvas attained a powerful memory and the formulas that support it.

source: གཟུངས་ཀྱི་ཡོན་ཏན་གྱི་བསྔགས་པའི་དཔེ་དགོད་པ་མི་ཟད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ།
en: This was the twenty-fourth chapter, “The Inexhaustible Nature of the Analogies in Praise of the Virtues of Powerful Memory and the Formulas That Support It.”

source: ཉི་ཤུ་རྩ་བཞི་པའོ།། །།
en: Chapter 25: Entrusting the True Dharma

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ལྔ་བརྒྱ་ཐ་མ་ལ་ཅི་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛམ་བུའི་གླིང་དུ་སྤྱོད་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Vajrapāṇi, Lord of the Guhyakas, then said to the Blessed One, “Blessed One, empower this formulation of the Dharma so that it may be circulated in the latter time.”

source: གསང་བ་པའི་བདག་པོ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ངས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་ལས་ཆོས་སྦ་བ་དང་། བསྲུང་བའི་གསང་སྔགས་ཀྱི་གཞི་གང་དག་ཐོས་པ་དེ་དག་ཁྱོད་ཀྱིས་དྲན་ནམ།
en: The Blessed One replied, “Lord of the Guhyakas, do you remember the words that protect the form of the Dharma, which were heard by me in the presence of the realized one Ratnacandra, so that I would take possession of the true Dharma?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་དེ་ལྟ་བས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྦ་བ་དང་། བསྲུང་བའི་གསང་སྔགས་ཀྱི་གཞི་དེ་དག་ཁྱོད་ཀྱིས་འཁོར་འདི་ལ་རྗོད་ཅིག །
en: “If that is so, Lord of the Guhyakas,” said the Blessed One, “then speak those words that protect the form of the Dharma here in the assembly so that this formulation of the Dharma lasts for a long time.

source: དེ་ལྟར་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ། །
en: Then this formulation of the Dharma will, indeed, last for a long time.”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ཏེ། གསང་སྔགས་ཀྱི་གཞི་འདི་དག་སྨྲས་སོ། །ཏདྱ་ཐཱ། ཛ་ཡ་ཛ་ཡ་མ་ཏི། ཛ་ཡ་ཤ་ཏྲུ། ཨ་ལེ། ཨ་མ་ལེ། ཨ་ལུ་ལི་ཏེ། མ་མེ། མ་མ་མ་ཏི། ནཱ་མ་སན་དྷི། ཨུད་ཏ་མེ། ཨུད་ཏ་མ་ཏི། ཨུད་ཏ་ར་ཎི། ཨ་རེ་ཨ་རམ་ཎི། ཨ་རི་ཤ་མ་ཎི། ཨ་མཱུ་ལེ། ཨ་མཱུ་ལ། ཨ་བང་ཊི་ཏི། མཱུ་ལ་ཨ་ནུ་ག་ཏེ། ཨད་ཏེ། མད་ཏེ། མ་ཊི་ཏེ། ཨ་ཊི། མ་ཊི་ཏེ། ཁུ་རུ་ཁུ་རུ། སན་དྷི་དྷརྨ་ཨ་ནུ་ག་ཏེ། དྷརྨ་ད་ཀྵེ། དྷ་རྨ་པྲ་བེ་ཤེ། །ས་རེ་ས་རེ་ས་རེ། ཨ་བེ་དྷེ། བེ་ད་སན་དྷི། ཨེ་ཧི། ཨེ་ཧི་ནི། ཨེ་ཏ་ད་ཨ་ནུ་ག་མེ། བདུད་རྣམས་ཚར་གཅོད་པ། མུ་སྟེགས་ཅན་རྣམས་འཛོམས་པ། ཆོས་ལ་གནོད་པར་སེམས་པ་རྣམས་རྨུགས་པར་བྱེད་པ། ཉོན་མོངས་པ་རྣམས་སེལ་བ།
en: Vajrapāṇi, Lord of the Guhyakas, then paid homage to all the buddhas of the ten directions and spoke the words of the mantra:

source: ཆོས་ཀྱི་ཚུལ་རྣམས་འབར་བར་བྱེད་པ། ཆོས་སྨྲ་བ་རྣམས་ཀུན་ཏུ་སྲུང་བ། མྱ་ངན་ལས་འདས་པར་འཛུད་པ། བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་རྣམས་ཡོངས་སུ་འཛིན་པ། འཁོར་ཡང་དག་པར་འཇོག་པ། ཆོས་ཉན་པ་རྣམས་ལ་ལུས་སྦྱིན་པར་བྱེད་པ། ཡང་དག་པར་སོང་བ་རྣམས་ཀྱིས་བསམ་པ། ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་བལྟ་བ། གསང་སྔགས་ཀྱི་གཞི་རྣམས་མངོན་དུ་འགྱུར་བ། གསང་སྔགས་ཀྱི་མཚམས་འགུག་པ། བརྗོད་པ་ཤེས་པ། ཕྱད་པ། མི་ཐུལ་པ། བསྟན་པའི་ངོ་བོ་ཉིད་ཆུད་ཟ་བར་མ་གྱུར་ཅིག །
en: tadyathā | jaya jayamati | jaya śatru | ale | amale | alulite | mame | mamamati | nāmasandhi | udtame | udtamati | udtaraṇi | are aramaṇi | ariśamaṇi | amūle | amūla | abadṭiti | mūlaanugate | adte | madte | maṭite | aṭi | maṭite | khurukhuru | sandhidharmaanugate | dharmadakṣe | dharmapraveśe | saresaresare | abedhe | bedasandhi | ehi | ehini | etadaanugame | defeating the māras | crushing the rival ascetics | bewildering those who hate the Dharma | blowing away the afflictions | shining light on the ways of the Dharma | protecting the discourses of the Dharma | entering nirvāṇa | grasping on to those who make beings ready for awakening | establishing an assembly | giving the body to those who have heard the Dharma | gaining the attention of those who have gone the right way | gaining the sight of those who have obtained what is right | manifesting the words of the mantra | gathering the interstices of the mantra | knowledge declaring | continuation | not liable to oppression | may the true nature of the teaching not perish | |

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཡོངས་སུ་བརྗོད་མ་ཐག་ཏུ་དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རབ་ཏུ་གཡོས་སོ། །
en: The very next moment after Vajrapāṇi, Lord of the Guhyakas, spoke these words of the mantra, this cosmos of a billion worlds shook.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བདུད་གང་དག་འཁོད་པ་དེ་དག་ཐམས་ཅད་དཔུང་དང་བཅས། གཡོག་འཁོར་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་གན་དུ་ལྷགས་ནས་ལུས་བཏུད་ཐལ་མོ་སྦྱར་ཏེ།
en: The māras in this cosmos of a billion worlds approached the Blessed One, along with their armies and their retinues, their bodies bent over in a crouch and their arms outstretched, palms together in a gesture of salutation, and they said this to the Blessed One:

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཆོས་སྨྲ་བ་སུའི་ཁའི་སྒོ་ནས་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འབྱུང་བ་དེ་ལ་རིམ་གྲོ་བགྱིའོ། །བསྙེན་བཀུར་བགྱིའོ། །
en: “We will attend upon and serve the preacher of the Dharma from whose mouth the words of this mantra issue, Blessed One.

source: བཅོམ་ལྡན་འདས་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་གི་དཔལ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་བཟོད་པར་རྔོ་ཐོག་པ་མ་ལགས་སོ། །
en: This world with its gods cannot endure the splendor of the words of this mantra, Blessed One.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཉིད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྦ་བར་བགྱིའོ། །གླགས་ལྟ་བ་གཞན་དག་ཀྱང་ཚར་གཅད་པར་བགྱིའོ། །
en: We will keep this formulation of the Dharma safe, Blessed One, and we will hold back anyone else who looks for a way to penetrate it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་ཕྱོགས་བཞི་ཀུན་ཏུ་གཟིགས་ཏེ། དེའི་ཚེ་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་བཀའ་སྩལ་ཏོ། །ཛ་ཡེ། དུར་ཛ་ཡེ། ཛ་ཡ་མ་ཏི། ཤ་མེ། ཤ་ཏྲུ་ནིར་གྷཏ་ནི། ཨ་མཱུ་ལེ། མཱུ་ལ་པ་རི་ཚིན་ནེ། མ་ར་སཻ་ནྱ་བི་ཏྲཱ་ས་ནི། མུག་ཏེ་མུག་ཏ་བ་ཏི། ཤུད་དྷེ། ཨ་བྷེ་དེ། བྷ་ཡ་མོ་ཙ་ནི། བྷ་རོ་ཧ་ར་ཎེ། ཏ་ད་ཏེ་བིདྱེ། བིདྱ་བ་ར་ཨུད་ཏ་མེ། ཕ་རོལ་རྒོལ་བ་ཚར་གཅོད་པ། །ཆོས་སྨྲ་བ་དག་ཀུན་སྡུད་པ། །ཆོས་ཀྱི་མཛོད་ནི་ཀུན་སྲུང་བ། །རིག་སྔགས་འདི་ནི་སངས་རྒྱས་གསུངས། །ཨ་མ། ཨ་མ་མེ། མ་མ་ཙྪེ་དེ། ཨརྠེ་ཨརྠ་ནི་སྟཱ་ར་ཎེ། འཇིག་རྟེན་སྐྱོང་བ་བཞི་དགུག་པའི་ཚིག་རྣམས་སྨྲས་པའོ། །དྷི་རེ། དྷི་ར་བ་ཏི། གུ་བ་ཏེ། ཤུ་བྷེཤུ་བྷ་བ་ཏི། ས་མེ།
en: Then, at that moment, after thoroughly surveying the four directions with the gaze of a bull elephant, the Blessed One spoke the words of this mantra:

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདིར་དགུག་པར་བྱའོ། མཻ་ཏྲེ་སོ་མ་བ་ཏི། ཀྵན་ཏི་ཀྲྀ་པ་ཀཱ་རུ་ཎ་ཨུདྀ་ཧྲ་དེ། པྲཱི་ཏི་ཨུ་པེ་ཀྵས་མ་པན་ཏེ། ཚངས་པ་ཡང་འདིར་དགུག་པར་བྱའོ། །ཨ་ར་ཊེ། པི་ར་ཊེ། ཁ་ཁེ། ཨ་མཱུ་ལེ། མཱུ་ལ་ཤོ་དྷ་ནི། བདུད་ནི་ཚར་གཅོད་བྱ་བའི་ཕྱིར། །གསང་སྔགས་གཞི་ནི་འདི་དག་སྨྲས། །མདོ་སྡེ་ལེགས་པར་བཤད་པ་འདི། །མི་ཡི་དབང་པོས་བྱིན་གྱིས་བརླབས། །གང་ཚེ་ཤེས་པར་འགྱུར་བ་ན། །དེ་ཡི་ཚེ་ན་སྤྱོད་པར་འགྱུར། །གསང་སྔགས་འདི་དག་རབ་བརྗོད་པས། །ས་ནི་རབ་ཏུ་གཡོས་པར་གྱུར། །བདུད་རྣམས་ཐམས་ཅད་ལྷགས་གྱུར་ཏེ། །འདི་སྐད་ཀྱི་ནི་ཚིག་སྨྲས་སོ། །ཕྱི་མའི་དུས་ན་མདོ་སྡེ་འདི། །
en: jaye | durjaye | jayamati | śame | śatrunirghatani | amūle | mūlaparichinne | mārasainyavitrāsani | mugte mugtavati | śuddhe | abhede | bhayamocani | bharoharaṇe | tad te vidye | vidyavaraudtame | repelling the proponents of other doctrines | gathering the proponents of the Dharma | protecting the treasury of the Dharma | this incantation revealed by the buddhas | ama | amame | mamacchede | arthe arthanistāraṇe | words summoning the four Lokapālas are spoken | dhire | dhiravati | gubte | śubhe śubhavati | same | the summoning here of Śakra, Lord of the Gods, will be done | maitre somavati | kṣānti­kṛpakāruṇaudahṛde | prītiupe­kṣasamapante | the summoning here of Brahmā too will be done | araṭe | viraṭe | kha khe | amūle | mūlaśodhani | for the purpose of repelling Māra | these words of the mantra are spoken | this well-spoken sūtra | empowered by the lord of men | will be practiced in the time | in which it will be known | these mantras that were spoken | have made the earth shake | and assembled all the māras | who have spoken this speech | we will protect | those preachers of the Dharma | into whose hands will go | this sūtra in the latter time | |

source: གང་དག་ལག་ཏུ་མཆི་འགྱུར་བ། ཆོས་སྨྲ་མཁས་པ་དེ་དག་ནི། །བདག་ཅག་རྣམས་ཀྱིས་བསྲུང་བར་བགྱི། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་ཤེས་པར་གྱིས་ཤིག །
en: The Blessed One then spoke to Vajrapāṇi, Lord of the Guhyakas: “Know, Lord of the Guhyakas, that this formulation of the Dharma has been empowered by the Realized One alone.

source: བྱིན་གྱིས་བརླབས་འདི་ནི་སུས་ཀྱང་རྣམ་པར་དཀྲུག་པར་མི་ནུས་སོ། །
en: It is not possible for anyone to disturb this empowerment.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། གསང་བ་པའི་བདག་པོ་ངས་མངོན་པར་ཤེས་ཏེ།
en: Why is that?

source: འདས་པའི་དུས་ན་བསྐལ་བ་མ་སྨད་པ་ཞེས་བྱ་བ་ལ། འཇིག་རྟེན་གྱི་ཁམས་མ་སྨད་པ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་ཟླ་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: Lord of the Guhyakas, I remember that a realized one named Ratnacandra arose in the past during an eon called Aninditā in a world called Aninditā.

source: དེ་བཞིན་གཤེགས་པ་དེའི་གསུང་རབ་ལ་དགེ་སློང་ཆོས་སྨྲ་བ། རྫུ་འཕྲུལ་ཆེ་བ། དབང་ཆེ་བར་གྲགས་པ། མཐུ་ཆེ་བ། ཤེས་རབ་འཕགས་ཞེས་བྱ་བ་དང་།
en: At that time, there were two monks in the dispensation of that blessed buddha, and they were preachers of the Dharma with great superhuman power, great exalted status, and great majestic power.

source: བདེན་པས་བྱིན་ཞེས་བྱ་བ་གཉིས་བྱུང་སྟེ།
en: Their names were Prajñodgata and Satyadatta.

source: ཆོས་སྨྲ་བ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་ལས་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བཟུང་ནས། བཅོམ་ལྡན་འདས་དེས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་བསྐལ་པ་ཕྱེད་ཚང་བར་རྗེས་སུ་བསྐོར་ནས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་འཁོད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ། བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ། །
en: “These two preachers of the Dharma retained the words of the mantra from that blessed one and for half an eon they followed to perfection the wheel of Dharma that had been turned by that blessed one, during which time all the billions of māras in that cosmos of a billion worlds were brought to maturity and propelled toward awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་དེ་བཞུགས་སམ། འོན་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ལགས།
en: At this point, the bodhisattva Śāntamati asked the Blessed One, “Does the realized one Ratnacandra remain, Blessed One, or has he already passed into complete cessation?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་དེ་ནི་ཤར་ཕྱོགས་ལོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུ་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མ་སྨད་པ་ཞེས་བྱ་བ་ན་བཞུགས་སོ། །
en: “The realized one Ratnacandra remains in Aninditā, which is more than ten trillion buddha domains to the east, Śāntamati,” the Blessed One answered.

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཁྲི་ཐུབ་བོ། །
en: “The lifespan of that realized one is ten thousand eons.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་བདུད་གང་དག་འཁོད་པ་དེ་དག་ཁྲོས་ཤིང་སྡང་བར་གྱུར་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེས་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་གིས་དེ་དག་བཏུལ། ལེགས་པར་ཡོངས་སུ་བཏུལ་ཏེ། དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Moreover, noble son, the māras in that realized one’s buddha domain were wrathful and wicked, and they were tamed, well and truly tamed, by the words of this mantra, and all of them were brought to maturity for the sake of their awakening.

source: རིགས་ཀྱི་བུ་ང་དང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་དེའི་གསུང་རབ་ལ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་བྱང་ཆུབ་ཏུ་ངེས་པར་བྱུང་སྟེ། ང་ནི་ཤེས་རབ་འཕགས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: “What is more, noble son, Vajrapāṇi, Lord of the Guhyakas, and I led the holy life in the dispensation of the realized one Ratnacandra, and we became adepts for the sake of awakening.

source: གསང་བ་པའི་བདག་པོ་ནི་བདེན་པས་བྱིན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: I was the one named Prajñodgata, and the Lord of the Guhyakas was the one named Satyadatta.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ངེད་གཉིས་ལྷན་ཅིག་ཏུ་འཐུན་པ་བག་ཡོད་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་དག་ལ་བསྟི་སྟང་དུ་བྱས་སོ། །བླ་མར་བྱས་སོ། །རིམ་གྲོར་བྱས་སོ། །མཆོད་པ་བྱས་སོ། །
en: For so it is, Śāntamati, that together we have served with care an immeasurable number of buddhas, honored them, respected them, and worshiped them.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་ནི་བདུད་ཚར་གཅད་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་གཅེས་སྤྲས་བྱེད་པར་འགྱུར་རོ། །
en: For so it is, too, Śāntamati, that these highly effective mantras are employed in order to defeat the māras and to take hold of the true Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་གཟིགས་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བསྐལ་པ་གྲངས་མེད་པར་བསྒྲུབས་པའི་བྱང་ཆུབ་འདི་ནུབ་པར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་གཟུང་བ་དང་། ཡོངས་སུ་བསྲུང་བར་ཁྱེད་ཀྱི་ནང་ནས་སུ་སྤྲོ།
en: At that point, the Blessed One surveyed the whole assembly and spoke thus: “Who among you, friends, has the courage to support and take hold of this awakening, accomplished over an incalculable length of time, so that it does not disappear when the Realized One has entered complete cessation?”

source: དེ་ནས་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཉིས་སྟོང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ལངས་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ངས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །ལུས་དང་སྲོག་ཀྱང་སྤང་བགྱིས་ལ། །
en: Then, in order to take hold of the true Dharma, twelve thousand bodhisattvas from within the assembly rose to their feet, and they knelt down on their right knees, and bowing down to the Blessed One with their palms joined together in a gesture of salutation, they spoke this verse:

source: རྣམ་པར་སྨིན་ལ་མི་རེ་བར། །
en: “We will remember this sūtra,

source: འཇིག་རྟེན་མགོན་པོས་གསུངས་པ་ཡིན། །
en: Taught by the Lord of the World, With no expectation of reward,

source: མདོ་སྡེ་འདི་ནི་གཟུང་བར་བགྱི། །
en: Surrendering even our bodies or lives.”

source: རྒྱལ་པོ་བཟང་ལ་སོགས་པ་ལྷའི་བུ་ལྔ་སྟོང་གིས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འདི་གཟུང་བར་བགྱིའོ། །
en: Then five thousand gods, including Bhadrarāja, joined their palms together in a gesture of salutation and said this to the Blessed One: “We will support the Realized One’s awakening, Blessed One.” Then they spoke this verse:

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ། །
en: “We will remember this sūtra,

source: སེམས་ཅན་ཀུན་གྱི་དོན་སླད་དུ། །
en: This profound teaching of the Buddha,

source: སྙིང་རྗེ་བརྟན་པར་བསྐྱེད་ནས་ནི། །སངས་རྒྱས་ཀྱིས་གསུངས་ཟབ་པ་ཡི། །
en: Out of a compassion made steady

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ཚངས་པ་གཙུག་པུད་ཅན་དང་། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: Then Śakra, Lord of the Gods, Brahmā Śikhin, and the Great King Vaiśravaṇa spoke this verse:

source: ནད་ཀུན་ལས་ནི་ཐར་བགྱིད་པ། །
en: “Our aspiration conceived for the highest,

source: མདོ་འདི་སྨན་དང་འདྲ་བ་ལགས། །སྟོན་པ་ལེགས་པར་སེམས་བསྐྱེད་དེ། །
en: We, too, will remember this sūtra, Teacher, which is the same as medicine

source: བདག་ཅག་གིས་ཀྱང་གཟུང་བར་བགྱི། །
en: That brings one freedom from all illness.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྐལ་པ་གྲངས་མ་མཆིས་པར་བསྒྲུབས་པ་འདི་གཟུང་བར་བགྱིའོ། །
en: Then Vajrapāṇi, Lord of the Guhyakas, said this to the Blessed One: “I, too, Blessed One, will remember the unsurpassable and perfect awakening of the Realized One, accomplished over an incalculable eon.” He then spoke a verse, too:

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ། །ཆོས་འདི་ཡི་གེ་མ་མཆིས་ན། །
en: “When the Dharma was wordless,

source: མི་ཡི་དབང་པོས་ཐུགས་རྗེ་ཡིས། །
en: The Lord of Men, with compassion,

source: ཡི་གེ་རྣམས་ཀྱིས་རབ་བཤད་པ། །
en: Expressed it with words,

source: དེ་ནི་བདག་གིས་གཟུང་བར་བགྱི། །
en: Words I will remember.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པ་གཙུག་པུད་ཅན་ལ་བཀའ་སྩལ་པ། ཚངས་པ་གསུམ་པོ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱེད་པ་བླ་ན་མེད་པའོ། །མཆོད་པའི་ལས་བླ་ན་མེད་པའོ། །བསོད་ནམས་ཚད་མེད་པ་འབྱུང་བའོ། །
en: The Blessed One then said to Brahmā Śikhin, “There are three forms of worship and service to the Realized One that cannot be surpassed, Brahmā, unsurpassable acts of worship that generate immeasurable merit.

source: གསུམ་གང་ཞེ་ན།
en: What are these three?

source: གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པ་དང་། གང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་འཛིན་པ་དང་། གང་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པ་སྟེ།
en: They are conceiving the aspiration for unsurpassable and perfect awakening, remembering the Dharma of the realized ones, and bringing one’s conduct into alignment with the Dharma precisely as one has learned it.

source: ཚངས་པ་གསུམ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བ་བླ་ན་མེད་པའོ། །
en: Brahmā, these are the three forms of worship and service to the Realized One that cannot be surpassed.

source: ཚངས་པ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཚེའི་ཚད་བསྐལ་པར་བཞུགས་པས་མཆོད་པའི་དངོས་པོ་གསུམ་པོ་འདི་དག་གི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་བསྐལ་པའི་བར་དུ་བསྟན་དུ་ཟིན་ཀྱང་མཐར་ཕྱིན་པར་མི་འགྱུར་རོ། །
en: Even if the Realized One remained for an eon, Brahmā, and he spent the entire eon describing the outcomes of the merit generated by those three forms of worship, he still would not complete the description.

source: ཚངས་པ་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བ་བླ་ན་མེད་པས་མཆོད་པ་བྱེད་འདོད་པས་མཆོད་པའི་དངོས་པོ་གསུམ་པོ་འདི་དག་གིས་མཆོད་པར་བྱའོ། །
en: Therefore, Brahmā, one who wishes to worship the Realized One with worship and service that cannot be surpassed should perform worship using these three forms of worship.

source: ཚངས་པ་དེ་བཞིན་གཤེགས་པ་གཅིག་གི་དམ་པའི་ཆོས་ཀྱི་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཡོངས་སུ་བཟུང་ན་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །
en: “If one remembers a single four-line verse from the true Dharma of a single realized one, then, Brahmā, the awakening of the realized ones of the past, present, and future will be retained.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚངས་པ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་ཆོས་ལས་ངེས་པར་བྱུང་བ་ཡིན་པས་དེ་ཆོས་ཀྱིས་མཆོད་པར་བྱའི་ཟང་ཟིང་གིས་ནི་མ་ཡིན་ནོ། །
en: The reason for this, Brahmā, is that the awakening of the realized ones is something that arises from the Dharma. Therefore, one should perform worship with the Dharma, and not with material objects.

source: དམ་པའི་ཆོས་ཀྱིས་མཆོད་པ་ནི་མཆོད་པ་ཐམས་ཅད་ཀྱི་ནང་ན་མཆོག་ཏུ་བཤད་དོ། །
en: Worship with the true Dharma is said to be supreme among all acts of worship.

source: དམ་པར་བཤད་དོ། །
en: It is said to be the true form;

source: ཕུལ་དུ་བཤད་དོ། །
en: it is said to be the best.

source: ཚངས་པ་ངས་མངོན་པར་ཤེས་ཏེ་འདས་པའི་དུས་ན་ང་རྒྱལ་པོའི་ཕོ་བྲང་ཞིག་ཏུ་སྐྱེས་ཏེ།
en: “Brahmā, I remember once upon a time in the past I was born in the palace of a king.

source: རྒྱལ་བུ་གཞོན་ནུ་བློ་གྲོས་ལྡན་ཞེས་བྱ་བར་གྱུར་པ་དེ་ནི་ངག་ཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ན་ཚིགས་སུ་བཅད་པ་གཉིས་ཐོས་ནས་བཟུང་བ་དང་།
en: At that time I was a young prince named Matimat, and I remembered two verses that I heard in a dream while I was asleep.

source: ང་སད་ནས་འདི་སྙམ་དུ་བསམས་ཏེ། བདག་གིས་གཏེར་ཆེན་པོ་ཞིག་རྙེད་དོ་སྙམ་ནས་ངས་གཏེར་ཆེན་པོ་ཞིག་རྙེད་དོ་ཞེས་སྐད་ཆེར་བྱུང་བ་དང་། ངའི་ཕ་མ་གཉིས་ན་རེ་གཞོན་ནུ་གཏེར་ག་ལ་ཡོད་ཅེས་ཟེར་རོ། །ངས་ཕ་མ་གཉིས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: When I awoke, the thought occurred to me, ‘I have found a great treasure,’ and I blurted out the words ‘I have found a great treasure!’ My parents said, ‘How could a child have found a treasure?’ Then I spoke these two verses to my parents:

source: འཇིག་རྟེན་གཏེར་ཆེན་རྣམས་ནི་རྒྱལ་པོ་དང་། །
en: “ ‘What the world considers to be great treasures

source: རྐུན་པོ་མེ་ཆུ་བསླུས་པས་ཟད་པར་འགྱུར། །
en: Can be lost, O King, to thieves, fire, water, and trickery.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐོས་གཏེར་ནི། །
en: Yet, the treasure of hearing the realized ones

source: བསྐལ་པ་བྱེ་བ་མང་པོར་ཆུད་མི་ཟ། །
en: Is not lost, even over many millions of eons. “ ‘Constant watchfulness is, indeed, the root of the deathless.

source: སེམས་ཅན་དོན་བརྩོན་བྱང་ཆུབ་སེམས་དང་ནི། །
en: So, too, the aspiration for awakening in one working to benefit beings.

source: ཚུལ་བཞིན་ཉིད་ཀྱིས་དབེན་སེམས་གང་ཡིན་དང་། །རྟག་ཏུ་བག་ཡོད་འཆི་མེད་རྒྱུ་ཡིན་ཏེ། །
en: So, too, is the mind, isolated and free, of one who pays careful attention,

source: ཡོངས་སུ་འཛིན་མེད་བདེ་བ་ཀུན་གྱི་རྒྱུ། །
en: While renunciation is the root of all happiness.’
